{
    "summaries": {
        "https://mp.weixin.qq.com/s/RRiW2seYkTbVAc5CypQ4-Q": "文章主要讲述了光线传媒通过投资《哪吒2》获得巨大成功的故事。《哪吒2》票房突破115亿元，成为全球影史榜前十的有力竞争者。光线传媒作为该片的主要出品方，自春节后开盘以来市值飙升720亿元，创下历史最高纪录。这一成功源于2015年光线传媒对导演饺子及其动画团队的投资。饺子凭借其作品《打，打个大西瓜》受到彩条屋总裁易巧的关注，并在光线传媒的支持下制作了《哪吒之魔童降世》和《哪吒2》，推动国产动画电影进入新的里程碑。此外，文章还回顾了光线传媒的发展历程及其打造“中国神话宇宙”的愿景，强调了国产动画崛起的时代背景。",
        "https://mp.weixin.qq.com/s/uSj692imM2-l2B6EWvr59g": "文章主要讨论了京东进军餐饮外卖市场的情况及其面临的挑战。京东通过“0佣金招募品质商家”的策略试图在竞争激烈的外卖市场中获得一席之地，但其即时物流网络不如美团和饿了么成熟，缺乏足够的骑手和管理经验。关于京东外卖骑手是否有社保的问题，作者指出实际上并没有，这与网上的一些传言不符。京东的快递小哥和外卖骑手是两个不同的群体，工作模式也不同，因此不能简单地将快递小哥转变为外卖骑手。此外，给外卖骑手买社保的成本非常高，对京东来说并不现实。最后，文章提到外卖行业的高质量发展需要平台提高精细化经营能力，并探索新的配送方式和技术，以降低成本、提升效率。京东在外卖市场的竞争力仍有待观察。",
        "https://mp.weixin.qq.com/s/_QsuxmWMdbWTJYDgGENsUA": "### 文章总结\n\n#### 一、整体概述\n2024年，得物算法团队针对多场景建模进行了多项优化工作，显著提升了在线业务指标，并将技术经验整理成论文，成功被顶级会议WWW'2025和DASFAA'2025录用。具体论文包括：\n1. **DSWIN**：Disentangling Scenario-wise Interest Network for Multi-scenario Recommendation。\n2. **SAINet**：Towards Scenario-adaptive User Behavior Modeling for Multi-scene Recommendation。\n3. **SACN**：When Multi-scenario Meets Multi-attribute: Scenario and Attribute-aware Recommendation with Contrastive Learning。\n\n#### 二、背景介绍\n随着线上购物平台的发展，多场景学习（MSL）在电商推荐系统中变得重要。得物App包含多种购物场景（如首页瀑布流、购物车页面等），不同场景下用户行为和兴趣差异明显。搜索场景也根据用户来源进行划分，需要解决的主要问题是如何有效刻画不同场景下的用户行为兴趣差异，并将场景信息融入行为序列建模。\n\n#### 三、整体优化思路\n1. **SACN**：通过引入多属性信息来刻画用户在特定场景下的偏好，并结合对比学习区分不同场景的兴趣。\n2. **SAINet**：通过堆叠多个Scenario-adaptive Block，自适应地将场景上下文融入用户行为序列，增强对场景间差异的建模能力。\n3. **DSWIN**：按场景对用户行为序列进行分组，提取全局和局部兴趣，并利用对比学习解分离不同场景的兴趣。\n\n#### 四、相关工作\n传统的多场景建模方法通常为每个场景训练单独模型，但这种方法复杂且无法捕捉场景间的相互关系。目前主流的方法包括：\n- **Scenario-specific network structures**：受多任务学习启发，为每个场景应用特定网络。\n- **Parameter adaptive network structures**：通过门机制动态调整模型参数，以学习场景多样性。\n\n#### 五、SACN\n- **结构**：结合Item-level和Attribute-level偏好提取模块，并利用对比学习区分不同场景的兴趣。\n- **实验结果**：在离线和在线测试中均优于现有方法，提升pvctr+1.02%。\n\n#### 六、SAINet\n- **结构**：通过Scenario-adaptive Block将场景信息作为side info加入用户行为序列，并使用Target-aware Interest Fusion和Scenario-aware DNN Tower进行融合和预测。\n- **实验结果**：在两个数据集上表现优于所有基线模型，验证了各模块的有效性。\n\n#### 七、DSWIN\n- **结构**：通过Global Interest Aggregation和Local Interest Resolution分别建模用户全局和局部兴趣，并利用Interest Disentangling Module解分离不同场景的兴趣。\n- **实验结果**：在离线和在线测试中均表现出色，提升pvctr+1.51%。\n\n#### 八、总结与展望\n未来可以考虑将场景化信息泛化到人群和行业，实现多人群和多行业的差异化建模。同时，可以进一步融合商品的多模态信息，实现多场景 & 多模态建模。"
    }
}